In [1]:
import pandas as pd

In [4]:
pd.Series([1,-5,3,14])

0     1
1    -5
2     3
3    14
dtype: int64

In [9]:
box=pd.Series([1,5,13,-9], index=("A","B","F","Hola"))
box[["A","Hola"]]

A       1
Hola   -9
dtype: int64

In [17]:
bounding_box =pd.Series([4, 6, -5, None], index=["x1", "x2", "y1", "y2"])
bounding_box/bounding_box.sum()

x1    0.8
x2    1.2
y1   -1.0
y2    NaN
dtype: float64

In [18]:
pd.isnull(bounding_box)

x1    False
x2    False
y1    False
y2     True
dtype: bool

In [59]:
data ={
    "name": ["Maria", "Carla", "Juan", "Ana", "Sergio"],
    "age": [15, 33, 12, 21, 45],
    "gender": [True, True, False, True, False]
 }
data= pd.DataFrame(data)
data

     name  age  gender
0   Maria   15    True
1   Carla   33    True
2    Juan   12   False
3     Ana   21    True
4  Sergio   45   False

In [49]:
csv = pd.read_csv("heart_data.csv")
#pd.DataFrame(csv)
csv.index

RangeIndex(start=0, stop=293, step=1)

In [41]:
data.index
data.index = ("M","C","J","C","S")
data

     name  age  gender
M   Maria   15    True
C   Carla   33    True
J    Juan   12   False
C     Ana   21    True
S  Sergio   45   False

In [42]:
data.loc["C"]

    name  age  gender
C  Carla   33    True
C    Ana   21    True

In [43]:
data.loc["J":"S"]

     name  age  gender
J    Juan   12   False
C     Ana   21    True
S  Sergio   45   False

In [57]:
df =pd.DataFrame(data, index=["m","c","j","a","s"])
df.drop("name", axis=1)

   age gender
m  NaN    NaN
c  NaN    NaN
j  NaN    NaN
a  NaN    NaN
s  NaN    NaN

In [63]:
data.sort_values(by="age")

     name  age  gender
2    Juan   12   False
0   Maria   15    True
3     Ana   21    True
1   Carla   33    True
4  Sergio   45   False

In [64]:
data.describe()

             age
count   5.000000
mean   25.200000
std    13.682105
min    12.000000
25%    15.000000
50%    21.000000
75%    33.000000
max    45.000000

In [67]:
# Comptar el numero de 
data["gender"].value_counts()

True     3
False    2
Name: gender, dtype: int64